; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v4)
             (pred_11 ?v8 ?v13)
             (pred_7 ?v12 ?v13)
             (pred_10 ?v10 ?v12 )
	     (pred_8 ?v12)
             (pred_9 ?v2)
             (pred_3 ?v8)
             (pred_2 ?v13)
             (pred_4 ?v12)
             (pred_1 ?v8)
             (pred_12 ?v12)
             (pred_5 ))



(:action op_1
:parameters (?v9 ?v1 ?v11 ?v3)
:precondition (and (pred_9 ?v9) (pred_9 ?v1) (pred_3 ?v11) (pred_2 ?v3)
          (pred_6 ?v9 ?v1) (pred_11 ?v11 ?v3)
                   (pred_7 ?v1 ?v3) (pred_8 ?v9) 
                   (pred_4 ?v1) (pred_1 ?v11))
:effect (and  (pred_12 ?v1) (not (pred_4 ?v1))))


(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_9 ?v9) (pred_9 ?v7)
               (pred_8 ?v9) (pred_6 ?v9 ?v7) (pred_12 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v9))))

(:action op_5
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_3 ?v11) 
                  (pred_8 ?v9) (pred_10 ?v11 ?v9) (pred_5 ))
:effect (and (pred_1 ?v11)
   (not (pred_10 ?v11 ?v9)) (not (pred_5 ))))


(:action op_4
:parameters (?v9 ?v6 ?v5)
:precondition (and (pred_9 ?v9) (pred_3 ?v6) (pred_3 ?v5)
                  (pred_8 ?v9) (pred_1 ?v5) (pred_10 ?v6 ?v9))
:effect (and (pred_1 ?v6) (pred_10 ?v5 ?v9)
        (not (pred_1 ?v5)) (not (pred_10 ?v6 ?v9))))

(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_3 ?v11) 
                  (pred_8 ?v9) (pred_1 ?v11))
:effect (and (pred_5 ) (pred_10 ?v11 ?v9) (not (pred_1 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_06 obj_15 obj_14 obj_01 obj_16 obj_19 obj_17 obj_13 obj_18 obj_12 obj_08 obj_07 obj_09 obj_02 obj_11
    obj_04 obj_20
    obj_05 obj_03
    )

    (:init
       (pred_5)

       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_12)
       (pred_9 obj_08)
       (pred_9 obj_07)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_11)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_3 obj_05)
       (pred_3 obj_03)

       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_10)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_08 obj_11)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_11 obj_08)
       (pred_6 obj_11 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_7  obj_06 obj_04)
       (pred_7  obj_11 obj_20)
       (pred_12 obj_10)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_09)
       (pred_12 obj_02)

       (pred_11  obj_05 obj_04)
       (pred_11  obj_03 obj_20)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_03 obj_07)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_10 obj_03 obj_18)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_3 obj_12 obj_18)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_09)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_09)
   goals met: 0 of 1
3. (op_3 obj_09 obj_07)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_03)
   deleted: (pred_10 obj_03 obj_07) (pred_5)
   added: (pred_1 obj_03)
   goals met: 0 of 1
5. (op_3 obj_07 obj_09)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_18)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_18)
   goals met: 0 of 1
7. (op_2 obj_18 obj_03)
   deleted: (pred_1 obj_03)
   added: (pred_5) (pred_10 obj_03 obj_18)
   goals met: 1 of 1
